#include "all_head.h"
/*******************************************
	硬件资源：
		1.测试用LED 
		   PB.12------------------->板载LED
		
		2.GPRS模块(A7)
    	 PA2--------------------->A7.U_RXD
			 PA3--------------------->A7.U_TXD
			
		3.电机模块()
			 PB.14(TIM1.CCR2)-------->IN1
			 PB.15(TIM1.CCR3)-------->IN2
		
		4. 人体传感器
			 PA.7-------------------->留一个排针就行
			 
		5.气味传感器
			 PA.5-------------------->MQ-153.DO
			 
		6.紫外线灯珠（1W LED 驱动器）
			 PA.4-------------------->PWM
		
		7.温湿度传感器(dht11)
			 PB11-------------------->dht11.DATA
			 PB10-------------------->Do
			 
		8.超声波传感器
			 PB.5-------------------->TRig
	     PB.6-------------------->ECHO
*******************************************/
int main(void)
{	
	all_init();
	while(1){
		LED=1;
		my_delay_ms(100);
	}
}





